/*************************************************************************
给定m行n列网格，有一个机器人从左上角（0,0）出发，每一步可以向下或者向右走一步
问有多少种不同走法
 ************************************************************************/

#include<stdio.h>
int main()
{
	int m, n;
	puts("请输入m和n的值");
	scanf("%d %d", &m, &n);
	int dp[m][n];
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			if (i == 0 || j == 0)
				dp[i][j] = 1;
			else
				dp[i][j] = dp[i-1][j]+dp[i][j-1];
		}
	}
	printf("共有%d种走法\n", dp[m-1][n-1]);
	return 0;
}
